app/controllers/posts_controller.rb

INSERT INTO "posts" ("admin_message", "content", "sender_id", "recipient_id", "rating", "willing_to_work", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.sender_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", "99f54bb7-4357-415b-a935-417eb3d362e4"], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", "99f54bb7-4357-415b-a935-417eb3d362e4"]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.destroy